An integer that describes the standard windows type of the dialog box.
  Namespace:   Autodesk.Revit.UI.Events
  Assembly:   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public int DialogType { get; }
  Visual Basic
Public ReadOnly Property DialogType As Integer
	Get
  Visual C++
public:
property int DialogType {
	int get ();
}
 See Also
  MessageBoxData Class
  Autodesk.Revit.UI.Events Namespace